# SAHIL BAVISHI
# 200968174

In [1]:
import pandas as pd

## Q1

In [2]:
data = {
        "rollNo": [1, 2, 3, 4, 5, 6, 7, 8 , 9, 10],
        "name": ["Sahil", "Saumya", "Aryan", "Veer", "Ishayu", "Srigna", "Anmol", "Shreyas", "Adnan", "Shashank"],
        "gender": ["M", "F", "M", "M", "M", "F", "F", "M", "M", "M"],
        "marks1": [91, 89, 77, 80, 49, 89, 67, 80, 45, 60],
        "marks2": [82, 84, 42, 77, 33, 66, 89, 69, 78, 55],
        "marks3": [77, 88, 37, 84, 35, 75, 80, 99, 55, 39]}

df = pd.DataFrame(data)
df.head()

   rollNo    name gender  marks1  marks2  marks3
0       1   Sahil      M      91      82      77
1       2  Saumya      F      89      84      88
2       3   Aryan      M      77      42      37
3       4    Veer      M      80      77      84
4       5  Ishayu      M      49      33      35

## Q2

In [3]:
df["Total Marks"] = df["marks1"] + df["marks2"] + df["marks3"]
df

   rollNo      name gender  marks1  marks2  marks3  Total Marks
0       1     Sahil      M      91      82      77          250
1       2    Saumya      F      89      84      88          261
2       3     Aryan      M      77      42      37          156
3       4      Veer      M      80      77      84          241
4       5    Ishayu      M      49      33      35          117
5       6    Srigna      F      89      66      75          230
6       7     Anmol      F      67      89      80          236
7       8   Shreyas      M      80      69      99          248
8       9     Adnan      M      45      78      55          178
9      10  Shashank      M      60      55      39          154

## Q3

In [4]:
print(df["marks1"].min())

45

## Q4

In [5]:
print(df["marks2"].max())

89

## Q5

In [6]:
print(df["marks3"].mean())

66.9

## Q6

In [9]:
df[df['Total Marks'] == df['Total Marks'].max()]['name']

1    Saumya
Name: name, dtype: object

## Q7

In [10]:
df[df['marks2'] < 40]['name']

4    Ishayu
Name: name, dtype: object